store/app/views/home/index.html.erb

SELECT "categories".* FROM "categories"
---
      <li class="nav-header">Categories</li>
      <% Category.all.each do |category| %>