store/app/views/b_products/index.html.erb

SELECT "categories".* FROM "categories"
---
        <li class="nav-header">Categories</li>
        <% Category.all.each do |category| %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
---
                    <td>
                      Category: <%= Category.find_by_id(product.category_id).name =%><br \>