store/app/views/carts/index.html.erb

          <td><%= link_to cart.id, cart_path(cart) %></td>
          <td><%= link_to User.find(cart.user_id).fname + " " + User.find(cart.user_id).lname, user_path(cart.user_id) %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]