store/app/views/orders/_form.html.erb

SELECT "carts".* FROM "carts"
---
    <div class="controls">
      <%= f.collection_select :cart_id, Cart.all, :id, :user_id, {} %>