store/app/controllers/b_carts_controller.rb

SELECT "carts".* FROM "carts"
---
  def index
    @carts = Cart.all