store/app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 11 May 2013 17:48:02 UTC +00:00], ["name", "Fiction"], ["updated_at", Sat, 11 May 2013 17:48:02 UTC +00:00]]

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]