store/app/controllers/products_controller.rb

INSERT INTO "products" ("category_id", "created_at", "description", "instock", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save