store/app/views/b_carts/index.html.erb

            <tr>
              <td><%= link_to User.find(cart.user_id).fname + " " + User.find(cart.user_id).lname, user_path(cart.user_id) %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1